isisbarajas/Proyecto2IsisBarajas/MKL25Z128xxx4_Proyecto2Semaforo/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t OesteBoton_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA1 (pin 27)  */
    GPIO_PinInit(BOARD_INITPINS_OesteBoton_GPIO, BOARD_INITPINS_OesteBoton_PIN, &OesteBoton_config);

    gpio_pin_config_t OesteVuelta_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA2 (pin 28)  */
    GPIO_PinInit(BOARD_INITPINS_OesteVuelta_GPIO, BOARD_INITPINS_OesteVuelta_PIN, &OesteVuelta_config);

    gpio_pin_config_t OesteVerde_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA4 (pin 30)  */
    GPIO_PinInit(BOARD_INITPINS_OesteVerde_GPIO, BOARD_INITPINS_OesteVerde_PIN, &OesteVerde_config);

    gpio_pin_config_t OesteAmarillo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA12 (pin 32)  */
    GPIO_PinInit(BOARD_INITPINS_OesteAmarillo_GPIO, BOARD_INITPINS_OesteAmarillo_PIN, &OesteAmarillo_config);

    gpio_pin_config_t NorteVerde_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_NorteVerde_GPIO, BOARD_INITPINS_NorteVerde_PIN, &NorteVerde_config);

    gpio_pin_config_t NorteAmarillo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB1 (pin 44)  */
    GPIO_PinInit(BOARD_INITPINS_NorteAmarillo_GPIO, BOARD_INITPINS_NorteAmarillo_PIN, &NorteAmarillo_config);

    gpio_pin_config_t NorteRojo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 45)  */
    GPIO_PinInit(BOARD_INITPINS_NorteRojo_GPIO, BOARD_INITPINS_NorteRojo_PIN, &NorteRojo_config);

    gpio_pin_config_t NorteVuelta_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB3 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_NorteVuelta_GPIO, BOARD_INITPINS_NorteVuelta_PIN, &NorteVuelta_config);

    gpio_pin_config_t EsteVuelta_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_EsteVuelta_GPIO, BOARD_INITPINS_EsteVuelta_PIN, &EsteVuelta_config);

    gpio_pin_config_t EsteRojo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_EsteRojo_GPIO, BOARD_INITPINS_EsteRojo_PIN, &EsteRojo_config);

    gpio_pin_config_t EsteAmarillo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 61)  */
    GPIO_PinInit(BOARD_INITPINS_EsteAmarillo_GPIO, BOARD_INITPINS_EsteAmarillo_PIN, &EsteAmarillo_config);

    gpio_pin_config_t EsteVerde_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 62)  */
    GPIO_PinInit(BOARD_INITPINS_EsteVerde_GPIO, BOARD_INITPINS_EsteVerde_PIN, &EsteVerde_config);

    gpio_pin_config_t EsteBoton_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 64)  */
    GPIO_PinInit(BOARD_INITPINS_EsteBoton_GPIO, BOARD_INITPINS_EsteBoton_PIN, &EsteBoton_config);

    gpio_pin_config_t OesteRojo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD4 (pin 77)  */
    GPIO_PinInit(BOARD_INITPINS_OesteRojo_GPIO, BOARD_INITPINS_OesteRojo_PIN, &OesteRojo_config);

    gpio_pin_config_t SurVerde_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE20 (pin 13)  */
    GPIO_PinInit(BOARD_INITPINS_SurVerde_GPIO, BOARD_INITPINS_SurVerde_PIN, &SurVerde_config);

    gpio_pin_config_t SurAmarillo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE21 (pin 14)  */
    GPIO_PinInit(BOARD_INITPINS_SurAmarillo_GPIO, BOARD_INITPINS_SurAmarillo_PIN, &SurAmarillo_config);

    gpio_pin_config_t SurRojo_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE22 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_SurRojo_GPIO, BOARD_INITPINS_SurRojo_PIN, &SurRojo_config);

    gpio_pin_config_t SurVuelta_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE23 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_SurVuelta_GPIO, BOARD_INITPINS_SurVuelta_PIN, &SurVuelta_config);

    gpio_pin_config_t SurBoton_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE29 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_SurBoton_GPIO, BOARD_INITPINS_SurBoton_PIN, &SurBoton_config);

    const port_pin_config_t OesteBoton = {/* Internal pull-up resistor is enabled */
                                          kPORT_PullUp,
                                          /* Slow slew rate is configured */
                                          kPORT_SlowSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as PTA1 */
                                          kPORT_MuxAsGpio};
    /* PORTA1 (pin 27) is configured as PTA1 */
    PORT_SetPinConfig(BOARD_INITPINS_OesteBoton_PORT, BOARD_INITPINS_OesteBoton_PIN, &OesteBoton);

    /* PORTA12 (pin 32) is configured as PTA12 */
    PORT_SetPinMux(BOARD_INITPINS_OesteAmarillo_PORT, BOARD_INITPINS_OesteAmarillo_PIN, kPORT_MuxAsGpio);

